In [161]:
# import libaries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from datetime import datetime, timedelta

In [162]:
zulo_bank = pd.read_csv(r"C:\Users\renef\OneDrive\Desktop\zulu_bank\zulo_bank_setup\zulo_bank.csv")

In [163]:
display(zulo_bank.head())

,FullName,Email,Phone,TransactionType,Amount,TransactionDate,AccountType,Balance,OpeningDate,LoanAmount,LoanType,StartDate,EndDate,InterestRate
0,Carol Miller,yfisher@example.org,6088279027,withdrawal,102.15,2023-04-26,Savings,5652.16,2019-08-12,NaN,NaN,NaN,NaN,NaN
1,Geoffrey Banks,gonzalesgeorge@example.net,001-546-857-6518x5359,withdrawal,358.80,2020-06-13,Credit,2881.24,2019-05-06,32428.90,Mortgage,2021-06-24,2050-01-08 04:59:17.907588,2.12
2,Geoffrey Banks,gonzalesgeorge@example.net,001-546-857-6518x5359,withdrawal,358.80,2020-06-13,Credit,2881.24,2019-05-06,31406.77,Personal,2021-02-27,2038-10-12 04:59:17.907821,4.63
3,Geoffrey Banks,gonzalesgeorge@example.net,001-546-857-6518x5359,withdrawal,358.80,2020-06-13,Credit,2881.24,2019-05-06,27834.00,Personal,2019-12-05,2037-08-15 04:59:17.909497,2.15
4,Geoffrey Banks,gonzalesgeorge@example.net,001-546-857-6518x5359,withdrawal,358.80,2020-06-13,Credit,2881.24,2019-05-06,27873.08,Auto,2022-01-19,2037-06-03 04:59:17.913974,7.03

In [164]:
# check the data info
display(zulo_bank.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1554 entries, 0 to 1553
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   FullName         1554 non-null   object
 1   Email            1554 non-null   object
 2   Phone            1554 non-null   object
 3   TransactionType  1554 non-null   object
 4   Amount           1554 non-null   float64
 5   TransactionDate  1554 non-null   object
 6   AccountType      1554 non-null   object
 7   Balance          1554 non-null   float64
 8   OpeningDate      1554 non-null   object
 9   LoanAmount       1278 non-null   float64
 10  LoanType         1278 non-null   object
 11  StartDate        1278 non-null   object
 12  EndDate          1278 non-null   object
 13  InterestRate     1278 non-null   float64
dtypes: float64(4), object(10)
memory usage: 170.1+ KB

None

In [165]:
# fill missing values
zulo_bank.fillna({
    "LoanAmount": 0.0,
    "LoanType": "Unknown",
    "InterestRate": 0.0,
    "LoanTerm": 0.0,
    "StartDate": "Unknown",
    "EndDate": "Unknown",
    }, inplace=True)

In [166]:
zulo_bank.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1554 entries, 0 to 1553
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   FullName         1554 non-null   object
 1   Email            1554 non-null   object
 2   Phone            1554 non-null   object
 3   TransactionType  1554 non-null   object
 4   Amount           1554 non-null   float64
 5   TransactionDate  1554 non-null   object
 6   AccountType      1554 non-null   object
 7   Balance          1554 non-null   float64
 8   OpeningDate      1554 non-null   object
 9   LoanAmount       1554 non-null   float64
 10  LoanType         1554 non-null   object
 11  StartDate        1554 non-null   object
 12  EndDate          1554 non-null   object
 13  InterestRate     1554 non-null   float64
dtypes: float64(4), object(10)
memory usage: 170.1+ KB

In [167]:
#convertto 1NF
#splitting the "FullName" into two parts "first_name"and "last_name"
zulo_bank[['first_name', 'last_name']] = zulo_bank['FullName'].str.split( expand=True)

display(zulo_bank.head())

,FullName,Email,Phone,TransactionType,Amount,TransactionDate,AccountType,Balance,OpeningDate,LoanAmount,LoanType,StartDate,EndDate,InterestRate,first_name,last_name
0,Carol Miller,yfisher@example.org,6088279027,withdrawal,102.15,2023-04-26,Savings,5652.16,2019-08-12,0.00,Unknown,Unknown,Unknown,0.00,Carol,Miller
1,Geoffrey Banks,gonzalesgeorge@example.net,001-546-857-6518x5359,withdrawal,358.80,2020-06-13,Credit,2881.24,2019-05-06,32428.90,Mortgage,2021-06-24,2050-01-08 04:59:17.907588,2.12,Geoffrey,Banks
2,Geoffrey Banks,gonzalesgeorge@example.net,001-546-857-6518x5359,withdrawal,358.80,2020-06-13,Credit,2881.24,2019-05-06,31406.77,Personal,2021-02-27,2038-10-12 04:59:17.907821,4.63,Geoffrey,Banks
3,Geoffrey Banks,gonzalesgeorge@example.net,001-546-857-6518x5359,withdrawal,358.80,2020-06-13,Credit,2881.24,2019-05-06,27834.00,Personal,2019-12-05,2037-08-15 04:59:17.909497,2.15,Geoffrey,Banks
4,Geoffrey Banks,gonzalesgeorge@example.net,001-546-857-6518x5359,withdrawal,358.80,2020-06-13,Credit,2881.24,2019-05-06,27873.08,Auto,2022-01-19,2037-06-03 04:59:17.913974,7.03,Geoffrey,Banks

In [168]:
# converting  1NF to 2NF
# Customer table
customer = zulo_bank[[ 'first_name', 'last_name', 'Email', 'Phone']].copy().drop_duplicates().reset_index(drop=True)
customer['Customer_id'] = range(1, len(customer) + 1)
customer = customer[['Customer_id', 'first_name', 'last_name', 'Email', 'Phone']]

In [169]:
customer

,Customer_id,first_name,last_name,Email,Phone
0,1,Carol,Miller,yfisher@example.org,6088279027
1,2,Geoffrey,Banks,gonzalesgeorge@example.net,001-546-857-6518x5359
2,3,Eric,Phillips,mark13@example.com,(699)516-7638x82918
3,4,Paul,Noble,harrisonrachel@example.net,+1-586-758-3968x3144
4,5,Ryan,Alexander,loganjohn@example.org,900.377.1792x148
...,...,...,...,...,...
82,83,Linda,Mendoza,lisaturner@example.net,(309)389-5448
83,84,Tony,Robinson,timothywiley@example.com,382-628-5059x479
84,85,Nicole,Stevens,colliermichael@example.net,(324)854-4855x79170
85,86,Philip,Huynh,bgraham@example.net,8058324167
86,87,Sheri,Johnson,michaelhahn@example.net,001-567-257-2127

In [170]:
# account table
account = zulo_bank[['AccountType', 'Balance', 'OpeningDate']].copy().drop_duplicates().reset_index(drop=True)
account['account_id'] = range(1, len(account) + 1)
account = account[['account_id', 'AccountType', 'Balance', 'OpeningDate']]

In [171]:
account

     account_id AccountType  Balance OpeningDate
0             1     Savings  5652.16  2019-08-12
1             2      Credit  2881.24  2019-05-06
2             3     Savings  2391.90  2020-09-17
3             4      Credit  7880.53  2023-08-14
4             5      Credit  3020.69  2019-08-13
..          ...         ...      ...         ...
193         194      Credit  7251.00  2022-11-18
194         195    Checking  7140.83  2019-09-23
195         196    Checking  1782.43  2020-12-24
196         197      Credit  6893.38  2021-04-22
197         198     Savings  4040.05  2023-08-24

[198 rows x 4 columns]

In [172]:
#transaction table
transaction = zulo_bank[['TransactionType', 'Amount', 'TransactionDate']].copy().drop_duplicates().reset_index(drop=True)
transaction['transaction_id'] = range(1, len(transaction) + 1)
transaction = transaction[['transaction_id', 'TransactionType', 'Amount', 'TransactionDate']]

In [173]:
transaction

     transaction_id TransactionType  Amount TransactionDate
0                 1      withdrawal  102.15      2023-04-26
1                 2      withdrawal  358.80      2020-06-13
2                 3         deposit  112.41      2019-05-17
3                 4         deposit  463.13      2020-09-02
4                 5      withdrawal   21.94      2022-07-03
..              ...             ...     ...             ...
995             996      withdrawal  303.30      2023-07-09
996             997         deposit  484.00      2020-12-27
997             998      withdrawal  427.36      2023-06-19
998             999      withdrawal  415.01      2022-02-09
999            1000         deposit  115.48      2021-10-16

[1000 rows x 4 columns]

In [174]:
#loan table
loan = zulo_bank[['LoanType', 'LoanAmount', 'InterestRate', 'StartDate', 'EndDate']].copy().drop_duplicates().reset_index(drop=True)
loan['loan_id'] = range(1, len(loan) + 1)
loan = loan[['loan_id', 'LoanType', 'LoanAmount', 'InterestRate', 'StartDate', 'EndDate']]

In [175]:
loan

,loan_id,LoanType,LoanAmount,InterestRate,StartDate,EndDate
0,1,Unknown,0.00,0.00,Unknown,Unknown
1,2,Mortgage,32428.90,2.12,2021-06-24,2050-01-08 04:59:17.907588
2,3,Personal,31406.77,4.63,2021-02-27,2038-10-12 04:59:17.907821
3,4,Personal,27834.00,2.15,2019-12-05,2037-08-15 04:59:17.909497
4,5,Auto,27873.08,7.03,2022-01-19,2037-06-03 04:59:17.913974
...,...,...,...,...,...,...
125,126,Personal,44785.92,1.55,2020-06-25,2050-08-25 04:59:17.912929
126,127,Personal,6815.56,2.90,2023-02-19,2033-12-16 04:59:17.907530
127,128,Auto,15095.53,4.58,2021-10-26,2053-12-08 04:59:17.908990
128,129,Mortgage,46561.79,2.50,2019-10-21,2033-08-13 04:59:17.913469
129,130,Personal,33481.52,5.06,2023-07-14,2048-08-02 04:59:17.914125

In [176]:
#Merge operations to create the zulo_bank
zulo_bank = zulo_bank.merge(customer, on=[ 'first_name', 'last_name', 'Email', 'Phone'], how='left') \
                     .merge(account, on=['AccountType', 'Balance', 'OpeningDate'], how='left') \
                     .merge(transaction, on=['TransactionType', 'Amount', 'TransactionDate'], how='left') \
                     .merge(loan, on=['LoanType', 'LoanAmount', 'InterestRate', 'StartDate', 'EndDate'], how='left') \
                     [["Customer_id", "account_id", "transaction_id", "loan_id",]]

In [177]:
zulo_bank

      Customer_id  account_id  transaction_id  loan_id
0               1           1               1        1
1               2           2               2        2
2               2           2               2        3
3               2           2               2        4
4               2           2               2        5
...           ...         ...             ...      ...
1549           20         165             997       29
1550           20         165             997       30
1551           25          94             998        1
1552            5          68             999       11
1553            6          76            1000       12

[1554 rows x 4 columns]

In [178]:
# convert 2NF to 3NF
#Create the date dimension table
#Define the start and end dates
start_date = datetime(2020, 1, 1)
current_date = datetime(2090, 12, 31)

# calculate the number of days between the start and end dates
num_days = (current_date - start_date).days

# Create a list of dates from start to current date
date_list = [start_date + timedelta(days=x) for x in range(num_days + 1)]

# ensure date_id matches the length of the date list
date = {"date_id": [x for x in range(1, len(date_list) +1)], "date" : date_list}

#create dataframe
date_dim = pd.DataFrame(date)
date_dim["year"] = date_dim["date"].dt.year
date_dim["month"] = date_dim["date"].dt.month
date_dim["day"] = date_dim["date"].dt.day
date_dim["date"] = pd.to_datetime(date_dim["date"]).dt.date  # Ensure the date column is in date format

# Convert the date column to datetime format

In [179]:
date_dim

       date_id        date  year  month  day
0            1  2020-01-01  2020      1    1
1            2  2020-01-02  2020      1    2
2            3  2020-01-03  2020      1    3
3            4  2020-01-04  2020      1    4
4            5  2020-01-05  2020      1    5
...        ...         ...   ...    ...  ...
25928    25929  2090-12-27  2090     12   27
25929    25930  2090-12-28  2090     12   28
25930    25931  2090-12-29  2090     12   29
25931    25932  2090-12-30  2090     12   30
25932    25933  2090-12-31  2090     12   31

[25933 rows x 5 columns]

In [180]:
zulo_bank.columns

Index(['Customer_id', 'account_id', 'transaction_id', 'loan_id'], dtype='object')

In [181]:
# Account table 2NF to 3NF
account["OpeningDate"] = pd.to_datetime(account['OpeningDate']).dt.date
account = account.merge(date_dim, left_on='OpeningDate', right_on='date', how='inner') \
                  .rename(columns={'date_id': 'OpeningDate_ID'}) \
                  .reset_index(drop=True) \
                    [['account_id', 'AccountType', 'Balance', 'OpeningDate_ID']]

In [182]:
account

     account_id AccountType  Balance  OpeningDate_ID
0             3     Savings  2391.90             261
1             4      Credit  7880.53            1322
2             6     Savings   947.43             857
3             7     Savings  4492.62             244
4             8      Credit  8439.15             310
..          ...         ...      ...             ...
153         193      Credit  6047.23             580
154         194      Credit  7251.00            1053
155         196    Checking  1782.43             359
156         197      Credit  6893.38             478
157         198     Savings  4040.05            1332

[158 rows x 4 columns]

In [183]:
# transaction table 2NF to 3NF
transaction  ['TransactionDate'] = pd.to_datetime(transaction['TransactionDate']).dt.date
transaction = transaction.merge(date_dim, left_on='TransactionDate', right_on='date', how='inner') \
                         .rename(columns={'date_id': 'TransactionDate_ID'}) \
                         .reset_index(drop=True) \
                         [['transaction_id', 'TransactionType', 'Amount', 'TransactionDate_ID']]

In [184]:
transaction

     transaction_id TransactionType  Amount  TransactionDate_ID
0                 1      withdrawal  102.15                1212
1                 2      withdrawal  358.80                 165
2                 4         deposit  463.13                 246
3                 5      withdrawal   21.94                 915
4                 8      withdrawal  256.62                 873
..              ...             ...     ...                 ...
805             996      withdrawal  303.30                1286
806             997         deposit  484.00                 362
807             998      withdrawal  427.36                1266
808             999      withdrawal  415.01                 771
809            1000         deposit  115.48                 655

[810 rows x 4 columns]

In [185]:
zulo_bank.columns

Index(['Customer_id', 'account_id', 'transaction_id', 'loan_id'], dtype='object')

In [186]:
# loan table 2NF to 3NF
loan['StartDate'] = loan['StartDate'].replace("Unknown", pd.NaT)
loan['EndDate'] = loan['EndDate'].replace("Unknown", pd.NaT)
loan['StartDate'] = pd.to_datetime(loan['StartDate']).dt.date
loan['EndDate'] = pd.to_datetime(loan['EndDate']).dt.date
loan = loan.merge(date_dim, left_on='StartDate', right_on='date', how='inner') \
           .rename(columns={'date_id': 'StartDate_ID'}) \
           .reset_index(drop=True) \
           [['loan_id', 'LoanType', 'LoanAmount', 'InterestRate', 'StartDate_ID', 'EndDate']]

In [187]:
loan

     loan_id  LoanType  LoanAmount  InterestRate  StartDate_ID     EndDate
0          2  Mortgage    32428.90          2.12           541  2050-01-08
1          3  Personal    31406.77          4.63           424  2038-10-12
2          5      Auto    27873.08          7.03           750  2037-06-03
3          6      Auto    25666.75          6.84          1225  2039-04-28
4          7  Personal    23853.85          7.41          1491  2038-02-12
..       ...       ...         ...           ...           ...         ...
98       125  Mortgage    48681.51          3.28           652  2035-05-09
99       126  Personal    44785.92          1.55           177  2050-08-25
100      127  Personal     6815.56          2.90          1146  2033-12-16
101      128      Auto    15095.53          4.58           665  2053-12-08
102      130  Personal    33481.52          5.06          1291  2048-08-02

[103 rows x 6 columns]

In [188]:
# save to our directory
output_dir = r"C:\Users\renef\OneDrive\Desktop\zulu_bank\zulo_bank_setup"

transaction.to_csv(f"{output_dir}\\transaction.csv", index=False)
loan.to_csv(f"{output_dir}\\loan.csv", index=False)
account.to_csv(f"{output_dir}\\account.csv", index=False)
customer.to_csv(f"{output_dir}\\customer.csv", index=False)
date_dim.to_csv(f"{output_dir}\\date_dim.csv", index=False)

#TRANSACTION DWH SCHEMA

In [189]:
Transaction_dim = transaction[['transaction_id', 'TransactionType', 'Amount', 'TransactionDate_ID']].copy().drop_duplicates().reset_index(drop=True)
account_dim = account[['account_id', 'AccountType', 'Balance', 'OpeningDate_ID']].copy().drop_duplicates().reset_index(drop=True)

transaction_fact_table = zulo_bank.merge(Transaction_dim, on='transaction_id', how='left') \
                                 .merge(account_dim, on='account_id', how='left') \
                                 [['transaction_id', 'account_id', 'AccountType', 'Balance', 'OpeningDate_ID', 'TransactionType', 'Amount', 'TransactionDate_ID']]

In [190]:
account

     account_id AccountType  Balance  OpeningDate_ID
0             3     Savings  2391.90             261
1             4      Credit  7880.53            1322
2             6     Savings   947.43             857
3             7     Savings  4492.62             244
4             8      Credit  8439.15             310
..          ...         ...      ...             ...
153         193      Credit  6047.23             580
154         194      Credit  7251.00            1053
155         196    Checking  1782.43             359
156         197      Credit  6893.38             478
157         198     Savings  4040.05            1332

[158 rows x 4 columns]

In [191]:
transaction_fact_table

,transaction_id,account_id,AccountType,Balance,OpeningDate_ID,TransactionType,Amount,TransactionDate_ID
0,1,1,NaN,NaN,NaN,withdrawal,102.15,1212.0
1,2,2,NaN,NaN,NaN,withdrawal,358.80,165.0
2,2,2,NaN,NaN,NaN,withdrawal,358.80,165.0
3,2,2,NaN,NaN,NaN,withdrawal,358.80,165.0
4,2,2,NaN,NaN,NaN,withdrawal,358.80,165.0
...,...,...,...,...,...,...,...,...
1549,997,165,Checking,6463.29,1376.0,deposit,484.00,362.0
1550,997,165,Checking,6463.29,1376.0,deposit,484.00,362.0
1551,998,94,NaN,NaN,NaN,withdrawal,427.36,1266.0
1552,999,68,NaN,NaN,NaN,withdrawal,415.01,771.0
1553,1000,76,Savings,9418.14,392.0,deposit,115.48,655.0

In [197]:
# save to memory
Transaction_dim.to_csv(r"transaction_dwh.csv", index=False)
account_dim.to_csv(r"account_dwh.csv", index=False)
transaction_fact_table.to_csv(r"transaction_fact_table.csv", index=False)
date_dim.to_csv(r"date_dim.csv", index=False)

# loan DWH SCHEMA

In [194]:
customer_dim = customer.copy()
loan_dim = loan[['loan_id', 'LoanType', 'LoanAmount', 'InterestRate', 'StartDate_ID', 'EndDate']].copy().drop_duplicates().reset_index(drop=True)

loan_fact_table = zulo_bank.merge(customer, on="Customer_id", how='inner') \
                           .merge(loan, on='loan_id', how='inner') \
                           [['Customer_id', 'loan_id', 'LoanType', 'LoanAmount', 'InterestRate', 'StartDate_ID', 'EndDate']]

In [195]:
loan_dim

     loan_id  LoanType  LoanAmount  InterestRate  StartDate_ID     EndDate
0          2  Mortgage    32428.90          2.12           541  2050-01-08
1          3  Personal    31406.77          4.63           424  2038-10-12
2          5      Auto    27873.08          7.03           750  2037-06-03
3          6      Auto    25666.75          6.84          1225  2039-04-28
4          7  Personal    23853.85          7.41          1491  2038-02-12
..       ...       ...         ...           ...           ...         ...
98       125  Mortgage    48681.51          3.28           652  2035-05-09
99       126  Personal    44785.92          1.55           177  2050-08-25
100      127  Personal     6815.56          2.90          1146  2033-12-16
101      128      Auto    15095.53          4.58           665  2053-12-08
102      130  Personal    33481.52          5.06          1291  2048-08-02

[103 rows x 6 columns]

In [199]:
# save to memory
loan_dim.to_csv(r"loan_dwh.csv", index=False)
customer_dim.to_csv(r"customer_dwh.csv", index=False)
loan_fact_table.to_csv(r"loan_fact_table.csv", index=False)

#LOADING INTO THE RDBMS USING PSYCOPG2

In [200]:
! pip install psycopg2

Requirement already satisfied: psycopg2 in c:\users\renef\anaconda3\anaconda3\lib\site-packages (2.9.10)

In [201]:
import psycopg2

In [205]:
# define the connection parameters
db_params = {
    "host": "localhost",
    "database": "zulo_bank",
    "user": "postgres",
    "password": "Kovikov1978@",   # <-- Add a comma here
    "port": 5432
}

In [206]:
import psycopg2

# Define your PostgreSQL connection string
default_db_url = "dbname=postgres user=postgres password=Kovikov1978@ host=localhost port=5432"

try:
    conn = psycopg2.connect(default_db_url)
    conn.autocommit = True
    cur = conn.cursor()
    
    # check if the database exists
    cur.execute("SELECT 1 FROM pg_catalog.pg_database WHERE datname = 'zulo_bank'")
    exists = cur.fetchone()
    if not exists:
        # Create the database if it does not exist
        cur.execute("CREATE DATABASE zulo_bank")
        print("Database 'zulo_bank' created successfully")
    else:
        print("Database 'zulo_bank' already exists.")
        
    # Close the cursor and connection
    cur.close()
    conn.close()
except psycopg2.Error as e:
    print(f"An Error connecting to the database: {e}")

Database 'zulo_bank' created successfully

In [217]:
def get_db_connection():
    try:
        connection = psycopg2.connect(
            host="localhost",
            database="zulo_bank",
            user="postgres",
            password="Kovikov1978@",
            port=5432
        )
        return connection
    except psycopg2.Error as e:
        print(f"Database connection failed: {e}")
        return None

In [220]:
def create_schema_and_tables():
    try:
        conn = get_db_connection()
        if conn is None:
            print("Failed to connect to the database.")
            return
        cur = conn.cursor()
        
        # Create schema
        cur.execute("CREATE SCHEMA IF NOT EXISTS zulo_bank")
        
        # Create date_dim table first
        cur.execute("""
            CREATE TABLE IF NOT EXISTS zulo_bank.date_dim (
                date_id SERIAL PRIMARY KEY,
                date VARCHAR(10000),
                year INT,
                month INT,
                day INT
            )
        """)
        
        # Now create other tables that reference date_dim
        cur.execute("""
            CREATE TABLE IF NOT EXISTS zulo_bank.customer (
                Customer_id SERIAL PRIMARY KEY,
                first_name VARCHAR(50),
                last_name VARCHAR(50),
                Email VARCHAR(100),
                Phone VARCHAR(20)
            )
        """)
        
        cur.execute("""
            CREATE TABLE IF NOT EXISTS zulo_bank.account (
                account_id SERIAL PRIMARY KEY,
                AccountType VARCHAR(50),
                Balance NUMERIC,
                OpeningDate_ID INT,
                FOREIGN KEY (OpeningDate_ID) REFERENCES zulo_bank.date_dim(date_id)
            )
        """)
        
        cur.execute("""
            CREATE TABLE IF NOT EXISTS zulo_bank.transaction (
                transaction_id SERIAL PRIMARY KEY,
                TransactionType VARCHAR(10000),
                Amount FLOAT,
                TransactionDate_ID INT,
                FOREIGN KEY (TransactionDate_ID) REFERENCES zulo_bank.date_dim(date_id)
            )
        """)
        
        cur.execute("""
            CREATE TABLE IF NOT EXISTS zulo_bank.loan (
                loan_id SERIAL PRIMARY KEY,
                LoanType VARCHAR(10000),
                LoanAmount FLOAT,
                InterestRate NUMERIC,
                StartDate_ID INT,
                EndDate DATE,
                FOREIGN KEY (StartDate_ID) REFERENCES zulo_bank.date_dim(date_id)
            )
        """)
        
        # Commit the changes
        conn.commit()
        print("Schema and tables created successfully.")
    except psycopg2.Error as e:
        print(f"An error occurred: {e}")
    finally:
        if conn:
            cur.close()
            conn.close()

In [221]:
#CREATE TABLES
create_schema_and_tables()

Schema and tables created successfully.

In [226]:
def load_customer_data_from_csv(csv_path):
    conn = get_db_connection()
    cursor = conn.cursor()
    with open(csv_path, 'r', encoding='utf-8') as file:
        reader = csv.reader(file)
        next(reader)  # Skip the header row
        for row in reader:
            first_name = row[1][:50]
            last_name = row[2][:50]
            email = row[3][:100]
            phone = row[4][:20]
            cursor.execute(
                "INSERT INTO zulo_bank.customer (first_name, last_name, Email, Phone) VALUES (%s, %s, %s, %s)",
                (first_name, last_name, email, phone)
            )
    conn.commit()
    cursor.close()
    conn.close()
    
 # provide the csv path to the file
csv_path = r"C:\Users\renef\OneDrive\Desktop\zulu_bank\zulo_bank_setup\customer.csv"

load_customer_data_from_csv(csv_path)
print("customer data loaded successfully.")

customer data loaded successfully.

In [227]:
#date_dim table
def load_date_dim_data_from_csv(csv_path):
    conn = get_db_connection()
    cursor = conn.cursor()
    with open(csv_path, 'r', encoding='utf-8') as file:
        reader = csv.reader(file)
        next(reader)  # Skip the header row
        for row in reader:
            date = row[1]
            year = int(row[2])
            month = int(row[3])
            day = int(row[4])
            cursor.execute(
                "INSERT INTO zulo_bank.date_dim (date, year, month, day) VALUES (%s, %s, %s, %s)",
                (date, year, month, day)
            )
    conn.commit()
    cursor.close()
    conn.close()
# provide the csv path to the file
csv_path = r"C:\Users\renef\OneDrive\Desktop\zulu_bank\zulo_bank_setup\date_dim.csv"
load_date_dim_data_from_csv(csv_path)   
print("date_dim data loaded successfully.")
# account table

date_dim data loaded successfully.

In [229]:
# account table
def load_account_data_from_csv(csv_path):
    conn = get_db_connection()
    cursor = conn.cursor()
    with open(csv_path, 'r', encoding='utf-8') as file:
        reader = csv.reader(file)
        next(reader)  # Skip the header row
        for row in reader:
            account_type = row[1][:50]
            balance = float(row[2])
            opening_date_id = int(row[3])
            cursor.execute(
                "INSERT INTO zulo_bank.account (AccountType, Balance, OpeningDate_ID) VALUES (%s, %s, %s)",
                (account_type, balance, opening_date_id)
            )
    conn.commit()
    cursor.close()
    conn.close()
# provide the csv path to the file
csv_path = r"C:\Users\renef\OneDrive\Desktop\zulu_bank\zulo_bank_setup\account.csv"
load_account_data_from_csv(csv_path)
print("account data loaded successfully.")

account data loaded successfully.

In [230]:
#transaction table
def load_transaction_data_from_csv(csv_path):
    conn = get_db_connection()
    cursor = conn.cursor()
    with open(csv_path, 'r', encoding='utf-8') as file:
        reader = csv.reader(file)
        next(reader)  # Skip the header row
        for row in reader:
            transaction_type = row[1][:10000]
            amount = float(row[2])
            transaction_date_id = int(row[3])
            cursor.execute(
                "INSERT INTO zulo_bank.transaction (TransactionType, Amount, TransactionDate_ID) VALUES (%s, %s, %s)",
                (transaction_type, amount, transaction_date_id)
            )
    conn.commit()
    cursor.close()
    conn.close()
# provide the csv path to the file
csv_path = r"C:\Users\renef\OneDrive\Desktop\zulu_bank\zulo_bank_setup\transaction.csv"
load_transaction_data_from_csv(csv_path)
print("transaction data loaded successfully.")

transaction data loaded successfully.

In [231]:
#loan table
def load_loan_data_from_csv(csv_path):
    conn = get_db_connection()
    cursor = conn.cursor()
    with open(csv_path, 'r', encoding='utf-8') as file:
        reader = csv.reader(file)
        next(reader)  # Skip the header row
        for row in reader:
            loan_type = row[1][:10000]
            loan_amount = float(row[2])
            interest_rate = float(row[3])
            start_date_id = int(row[4])
            end_date = row[5] if row[5] != 'Unknown' else None
            cursor.execute(
                "INSERT INTO zulo_bank.loan (LoanType, LoanAmount, InterestRate, StartDate_ID, EndDate) VALUES (%s, %s, %s, %s, %s)",
                (loan_type, loan_amount, interest_rate, start_date_id, end_date)
            )
    conn.commit()
    cursor.close()
    conn.close()    
# provide the csv path to the file
csv_path = r"C:\Users\renef\OneDrive\Desktop\zulu_bank\zulo_bank_setup\loan.csv"
load_loan_data_from_csv(csv_path)   
print("loan data loaded successfully.")

loan data loaded successfully.